---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RebarFailures.OutSideOfHost
source: html/1f58fcc4-b622-4f8d-2575-cf0c24ae6dae.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RebarFailures.OutSideOfHost Property

Rebar is placed completely outside of its host.

## Syntax (C#)
```csharp
public static FailureDefinitionId OutSideOfHost { get; }
```